zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/psio_reg.h
#define PSIO_SCCT_SCCTL_REPEAT_Pos       (17)                                              /*!< PSIO_T::SCCTL: REPEAT Position         */
#define PSIO_SCCT_SCCTL_REPEAT_Msk       (0x1ul << PSIO_SCCT_SCCTL_REPEAT_Pos)             /*!< PSIO_T::SCCTL: REPEAT Mask             */

#define PSIO_SCCT_SCCTL_STOP_Pos         (18)                                              /*!< PSIO_T::SCCTL: STOP Position           */
#define PSIO_SCCT_SCCTL_STOP_Msk         (0x1ul << PSIO_SCCT_SCCTL_STOP_Pos)               /*!< PSIO_T::SCCTL: STOP Mask               */

#define PSIO_SCCT_SCCTL_BUSY_Pos         (24)                                              /*!< PSIO_T::SCCTL: BUSY Position           */
#define PSIO_SCCT_SCCTL_BUSY_Msk         (0x1ul << PSIO_SCCT_SCCTL_BUSY_Pos)               /*!< PSIO_T::SCCTL: BUSY Mask               */

#define PSIO_SCCT_SCCTL_IDLE_Pos         (25)                                              /*!< PSIO_T::SCCTL: IDLE Position           */
#define PSIO_SCCT_SCCTL_IDLE_Msk         (0x1ul << PSIO_SCCT_SCCTL_IDLE_Pos)               /*!< PSIO_T::SCCTL: IDLE Mask               */

#define PSIO_SCCT_SCSLOT_SLOT0CNT_Pos    (0)                                               /*!< PSIO_T::SCSLOT: SLOT0CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT0CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT0CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT0CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT1CNT_Pos    (4)                                               /*!< PSIO_T::SCSLOT: SLOT1CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT1CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT1CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT1CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT2CNT_Pos    (8)                                               /*!< PSIO_T::SCSLOT: SLOT2CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT2CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT2CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT2CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT3CNT_Pos    (12)                                              /*!< PSIO_T::SCSLOT: SLOT3CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT3CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT3CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT3CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT4CNT_Pos    (16)                                              /*!< PSIO_T::SCSLOT: SLOT4CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT4CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT4CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT4CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT5CNT_Pos    (20)                                              /*!< PSIO_T::SCSLOT: SLOT5CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT5CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT5CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT5CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT6CNT_Pos    (24)                                              /*!< PSIO_T::SCSLOT: SLOT6CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT6CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT6CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT6CNT Mask          */

#define PSIO_SCCT_SCSLOT_SLOT7CNT_Pos    (28)                                              /*!< PSIO_T::SCSLOT: SLOT7CNT Position      */
#define PSIO_SCCT_SCSLOT_SLOT7CNT_Msk    (0xful << PSIO_SCCT_SCSLOT_SLOT7CNT_Pos)          /*!< PSIO_T::SCSLOT: SLOT7CNT Mask          */

#define PSIO_GNCT_GENCTL_IOMODE_Pos      (0)                                               /*!< PSIO_T::GENCTL: IOMODE Position        */
#define PSIO_GNCT_GENCTL_IOMODE_Msk      (0x3ul << PSIO_GNCT_GENCTL_IOMODE_Pos)            /*!< PSIO_T::GENCTL: IOMODE Mask            */

#define PSIO_GNCT_GENCTL_INITIAL_Pos     (2)                                               /*!< PSIO_T::GENCTL: INITIAL Position       */
#define PSIO_GNCT_GENCTL_INITIAL_Msk     (0x3ul << PSIO_GNCT_GENCTL_INITIAL_Pos)           /*!< PSIO_T::GENCTL: INITIAL Mask           */

#define PSIO_GNCT_GENCTL_INTERVAL_Pos    (4)                                               /*!< PSIO_T::GENCTL: INTERVAL Position      */
#define PSIO_GNCT_GENCTL_INTERVAL_Msk    (0x3ul << PSIO_GNCT_GENCTL_INTERVAL_Pos)          /*!< PSIO_T::GENCTL: INTERVAL Mask          */

#define PSIO_GNCT_GENCTL_SW0CP_Pos       (8)                                               /*!< PSIO_T::GENCTL: SW0CP Position         */
#define PSIO_GNCT_GENCTL_SW0CP_Msk       (0xful << PSIO_GNCT_GENCTL_SW0CP_Pos)             /*!< PSIO_T::GENCTL: SW0CP Mask             */

#define PSIO_GNCT_GENCTL_SW1CP_Pos       (12)                                              /*!< PSIO_T::GENCTL: SW1CP Position         */
#define PSIO_GNCT_GENCTL_SW1CP_Msk       (0xful << PSIO_GNCT_GENCTL_SW1CP_Pos)             /*!< PSIO_T::GENCTL: SW1CP Mask             */

#define PSIO_GNCT_GENCTL_MODESW0_Pos     (16)                                              /*!< PSIO_T::GENCTL: MODESW0 Position       */
#define PSIO_GNCT_GENCTL_MODESW0_Msk     (0x3ul << PSIO_GNCT_GENCTL_MODESW0_Pos)           /*!< PSIO_T::GENCTL: MODESW0 Mask           */

#define PSIO_GNCT_GENCTL_MODESW1_Pos     (18)                                              /*!< PSIO_T::GENCTL: MODESW1 Position       */
#define PSIO_GNCT_GENCTL_MODESW1_Msk     (0x3ul << PSIO_GNCT_GENCTL_MODESW1_Pos)           /*!< PSIO_T::GENCTL: MODESW1 Mask           */

#define PSIO_GNCT_GENCTL_SCSEL_Pos       (24)                                              /*!< PSIO_T::GENCTL: SCSEL Position         */
#define PSIO_GNCT_GENCTL_SCSEL_Msk       (0x3ul << PSIO_GNCT_GENCTL_SCSEL_Pos)             /*!< PSIO_T::GENCTL: SCSEL Mask             */

#define PSIO_GNCT_GENCTL_PINEN_Pos       (26)                                              /*!< PSIO_T::GENCTL: PINEN Position         */
#define PSIO_GNCT_GENCTL_PINEN_Msk       (0x1ul << PSIO_GNCT_GENCTL_PINEN_Pos)             /*!< PSIO_T::GENCTL: PINEN Mask             */

#define PSIO_GNCT_DATCTL_OUTDATWD_Pos    (0)                                               /*!< PSIO_T::DATCTL: OUTDATWD Position      */
#define PSIO_GNCT_DATCTL_OUTDATWD_Msk    (0x1ful << PSIO_GNCT_DATCTL_OUTDATWD_Pos)         /*!< PSIO_T::DATCTL: OUTDATWD Mask          */

#define PSIO_GNCT_DATCTL_INDATWD_Pos     (8)                                               /*!< PSIO_T::DATCTL: INDATWD Position       */
#define PSIO_GNCT_DATCTL_INDATWD_Msk     (0x1ful << PSIO_GNCT_DATCTL_INDATWD_Pos)          /*!< PSIO_T::DATCTL: INDATWD Mask           */

